// 设置为全局变量
window.config = {
    // 安全配置
    security: {
        question: '根据jwpnu给出答案(提示：凯撒密码，你的学号，可以直接AI)',
        answer: 'angel'
    },
    
    // 生日信息
    birthdayInfo: {
        name: '生日快乐',
        date: '2024-11-28'
    },
    
    // 祝福语数组
    wishes: [
        '愿你的生日充满无限的快乐，愿你今天的回忆温馨，愿你所有的梦想甜美，愿你的一年称心如意！',
        '生日快乐！愿你生命中的每一天都充满阳光和快乐！',
        '愿你的生日特别快乐，愿新的一年中心想事成！',
        '祝生日快乐，天天开心，永远年轻美丽！',
        '在你生日的这一天，将快乐的音符，作为礼物送给你，愿你一年365天快快乐乐，平平安安！(这些是AI自己生成的)'
    ],
    
    // 个人留言
    personalMessage: '额......你好呀，先祝你生日快乐吧！不知道你会不会看呢？(真的真的好想再和你聊聊天)上面的密码就是你在我心中的地位哦。现在确实有不少算是朋友的人吧，有时能随便说说话或者打游戏什么的，但有些话确实说不出来。网上总说男生应该报喜不报忧，不能让鄙人看出自己情绪的难过，但总是带上面具害怕把自己也欺骗了。'
};
